# Changing column names

In [5]:
d={'Ojas':['Gupta','Sharma','Tikoo'],'Mahi':['Sangral','mehta','Dubey']}

In [6]:
d

{'Ojas': ['Gupta', 'Sharma', 'Tikoo'], 'Mahi': ['Sangral', 'mehta', 'Dubey']}

In [7]:
import pandas as pd

In [8]:
val=pd.DataFrame(d)

In [9]:
d

{'Ojas': ['Gupta', 'Sharma', 'Tikoo'], 'Mahi': ['Sangral', 'mehta', 'Dubey']}

In [10]:
val

     Ojas     Mahi
0   Gupta  Sangral
1  Sharma    mehta
2   Tikoo    Dubey

In [11]:
val.rename(columns={'Ojas':'Avni','Mahi':'Mahak'},inplace=True)

In [12]:
print(val)

     Avni    Mahak
0   Gupta  Sangral
1  Sharma    mehta
2   Tikoo    Dubey

In [13]:
val

     Avni    Mahak
0   Gupta  Sangral
1  Sharma    mehta
2   Tikoo    Dubey

In [14]:
liss=['Raghav','Mahak']

In [15]:
val.columns=liss

In [16]:
val

   Raghav    Mahak
0   Gupta  Sangral
1  Sharma    mehta
2   Tikoo    Dubey

# Sorting

In [17]:
from sklearn.datasets import load_boston

In [18]:
boston=load_boston()

In [19]:
df=pd.DataFrame(boston.data,columns=[boston.feature_names])

In [20]:
df.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33

In [24]:
df.columns

MultiIndex([(   'CRIM',),
            (     'ZN',),
            (  'INDUS',),
            (   'CHAS',),
            (    'NOX',),
            (     'RM',),
            (    'AGE',),
            (    'DIS',),
            (    'RAD',),
            (    'TAX',),
            ('PTRATIO',),
            (      'B',),
            (  'LSTAT',)],
           )

In [26]:
df.loc[2:5,['INDUS','TAX','B']]

  INDUS    TAX       B
2  7.07  242.0  392.83
3  2.18  222.0  394.63
4  2.18  222.0  396.90
5  2.18  222.0  394.12